FirstRoutes/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
    def index
        # render plain: "HELLO"

        @users = User.all