ArtShare/app/controllers/artworks_controller.rb

    def index
        user_id = params[:id]
        @artworks = Artwork.select('*').joins(:users).where("artworks.artist_id = #{params[:user_id]}")
---
SELECT * FROM "artworks" INNER JOIN "artwork_shares" ON "artwork_shares"."artwork_id" = "artworks"."id" INNER JOIN "users" ON "users"."id" = "artwork_shares"."viewer_id" WHERE (users.id = 2)

    def show
        @artworks = Artwork.find(params[:id])
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def destroy
        @artworks = Artwork.find(params[:id])
        @artworks.destroy
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 17]]