ArtShare/app/controllers/comments_controller.rb

    def index
        debugger
        if params[:user_id] && params[:artwork_id]
            @comments = Comment.select('*').joins(:artwork).where("artworks.id = #{params[:artwork_id]}")
            @artworks = Comment.select('*').joins(:author).where("user.id = #{params[:user_id]}")
            render json: (@artworks + @comments)

        elsif params[:user_id]
            @comments = Comment.select('*').joins(:author).where()
            render json: @comments
        elsif params[:artwork_id]

            @comments = Comment.select('*').joins(:artwork).where("artworks.id = #{params[:artwork_id]}")
---
SELECT * FROM "comments" INNER JOIN "artworks" ON "artworks"."id" = "comments"."artwork_id" WHERE "comments"."artwork_id" = $1  [["artwork_id", 20]]
SELECT * FROM "comments" INNER JOIN "artworks" ON "artworks"."id" = "comments"."artwork_id" WHERE "comments"."user_id" = $1  [["user_id", 32]]