ArtShare/app/controllers/likes_controller.rb

    def create
        debugger
        like = Like.new(like_params)
        if like.save
---
INSERT INTO "likes" ("likeable_type", "likeable_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["likeable_type", "Artwork"], ["likeable_id", 34], ["created_at", "2021-11-11 21:42:58.452350"], ["updated_at", "2021-11-11 21:42:58.452350"], ["user_id", 56]]

    def destroy
        @likes = Like.find(params[:id])
        @likes.destroy
---
SELECT  "likes".* FROM "likes" WHERE "likes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 5]]