ArtShare/app/controllers/users_controller.rb

    def index
        if params[:username]
            @user =
            User
                .select('*')
                .where("LOWER(username) LIKE '%#{params[:username].downcase}%'")
            render json: @user
        else
            @users = User.all
---
SELECT * FROM "users" WHERE (username LIKE '%a%' OR username LIKE '%A%')

    def destroy
        @users = User.find(params[:id])
        @users.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 4]]